In [1]:
import pandas as pd
from sqlalchemy import text as sql_text, create_engine, inspect

### Criar engine

In [4]:
engine = create_engine("sqlite:///:memory:")

In [16]:
conn = engine.connect()
conn.execution_options(isolation_level="AUTOCOMMIT")

### Carregar dados

In [3]:
url = "https://raw.githubusercontent.com/alura-cursos/Pandas/main/clientes_banco.csv"
dados = pd.read_csv(url)

### Escrever os dados do arquivo CSV neste banco de dados local.

In [17]:
conn.execute(sql_text('DROP TABLE IF EXISTS clientes'))
dados.to_sql('clientes', conn, index=False)

438463

### Realizar três atualizações no banco de dados:

- Atualizar o registro do cliente de ID 6840104 que teve o rendimento anual alterado para 300000.

In [18]:
query = sql_text("UPDATE clientes SET Rendimento_Anual = 300000 WHERE ID_Cliente = 6840104 ")
conn.execute(query)
pd.read_sql(sql_text("SELECT Rendimento_Anual from clientes WHERE ID_Cliente = 6840104"), conn)

   Rendimento_anual
0          300000.0

- Excluir o registro do cliente de ID 5008809, pois essa pessoa não possui mais conta na instituição financeira.

In [19]:
pd.read_sql(sql_text("SELECT * FROM clientes WHERE ID_Cliente = 5008809"), conn)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio

In [20]:
query = sql_text("DELETE from clientes WHERE ID_Cliente = 5008809")
conn.execute(query)
pd.read_sql(sql_text("SELECT * FROM clientes WHERE ID_Cliente = 5008809"), conn)

Empty DataFrame
Columns: [ID_Cliente, Idade, Grau_escolaridade, Estado_civil, Tamanho_familia, Categoria_de_renda, Ocupacao, Anos_empregado, Rendimento_anual, Tem_carro, Moradia]
Index: []

- Criar um novo registro de cliente seguindo as especificações abaixo:

In [25]:
query = sql_text("DELETE from clientes WHERE ID_Cliente = 6850985")
conn.execute(query)
query = sql_text("INSERT INTO clientes (ID_Cliente, Idade, Grau_escolaridade, Estado_civil, Tamanho_Familia, Categoria_de_renda, Ocupacao, Anos_empregado, Rendimento_anual, Tem_carro, Moradia) VALUES( 6850985, 33, 'Doutorado', 'Solteiro', 1, 'Empregado', 'TI', 2, 290000, 0, 'Casa/apartamento próprio')")
conn.execute(query)
pd.read_sql(sql_text("SELECT * FROM clientes WHERE ID_Cliente = 6850985"), conn)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,6850985,33,Doutorado,Solteiro,1,Empregado,TI,2,290000.0,0,Casa/apartamento próprio